opentx/opentx/applets/libraries/libchip_atsam3s/include/ATSAM3S4.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2009, Atmel Corporation                                       */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */
/*                                                                              */
/* File Name    : AT91SAM3S.h */
/* Object       : AT91SAM3S definitions */
/* Generated by : AT91 SW Application Group */
/* Generated on : 2009-12-01 */

#ifndef AT91SAM3S_H
#define AT91SAM3S_H

/** \addtogroup AT91SAM3S_definitions AT91SAM3S definitions
  This file defines all structures and symbols for AT91SAM3S:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#ifndef __ASSEMBLY__
#  include <stdint.h>
#  ifndef __cplusplus
typedef volatile const uint32_t RoReg; /**< Read only 32-bit register (volatile const unsigned int) */
#  else
typedef volatile       uint32_t RoReg; /**< Read only 32-bit register (volatile const unsigned int) */
#  endif
typedef volatile       uint32_t WoReg; /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg; /**< Read-Write 32-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *) value)
#define REG_ACCESS(type, address) (*(type*)address) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR AT91SAM3S */
/* ************************************************************************** */
/** \addtogroup AT91SAM3S_cmsis CMSIS Definitions */

/*@{*/

/**
 * \brief Configuration of the Cortex-M3 Processor and Core Peripherals
 */
#define __MPU_PRESENT             0 /**< AT91SAM3S does not provide a MPU present or not */
#define __NVIC_PRIO_BITS          4 /**< AT91SAM3S uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0 /**< Set to 1 if different SysTick Config is used */

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M3 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M3 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M3 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M3 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M3 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M3 System Tick Interrupt       */
/******  AT91SAM3S specific Interrupt Numbers *********************************/

  SUPC_IRQn            =  0, /**<  0 AT91SAM3S Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 AT91SAM3S Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 AT91SAM3S Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 AT91SAM3S Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 AT91SAM3S Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 AT91SAM3S Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 AT91SAM3S Enhanced Flash Controller (EFC) */
  UART0_IRQn           =  8, /**<  8 AT91SAM3S UART 0 (UART0) */
  UART1_IRQn           =  9, /**<  9 AT91SAM3S UART 1 (UART1) */
  SMC_IRQn             = 10, /**< 10 AT91SAM3S Static Memory Controller (SMC) */
  PIOA_IRQn            = 11, /**< 11 AT91SAM3S Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 AT91SAM3S Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 13, /**< 13 AT91SAM3S Parallel I/O Controller C (PIOC) */
  USART0_IRQn          = 14, /**< 14 AT91SAM3S USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 AT91SAM3S USART 1 (USART1) */
  HSMCI_IRQn           = 18, /**< 18 AT91SAM3S Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 19, /**< 19 AT91SAM3S Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 20, /**< 20 AT91SAM3S Two Wire Interface 1 (TWI1) */
  SPI_IRQn             = 21, /**< 21 AT91SAM3S Serial Peripheral Interface (SPI) */
  SSC_IRQn             = 22, /**< 22 AT91SAM3S Synchronous Serial Controler (SSC) */
  TC0_IRQn             = 23, /**< 23 AT91SAM3S Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 AT91SAM3S Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 AT91SAM3S Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 AT91SAM3S Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 AT91SAM3S Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 AT91SAM3S Timer/Counter 5 (TC5) */
  ADC_IRQn             = 29, /**< 29 AT91SAM3S Analog To Digital Converter (ADC) */
  DACC_IRQn            = 30, /**< 30 AT91SAM3S Digital To Analog Converter (DACC) */
  PWM_IRQn             = 31, /**< 31 AT91SAM3S Pulse Width Modulation (PWM) */
  CRCCU_IRQn           = 32, /**< 32 AT91SAM3S CRC Calculation Unit (CRCCU) */
  ACC_IRQn             = 33, /**< 33 AT91SAM3S Analog Comparator (ACC) */
  UDP_IRQn             = 34 /**< 34 AT91SAM3S USB Device Port (UDP) */
} IRQn_Type;
/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR AT91SAM3S */
/* ************************************************************************** */
/** \addtogroup AT91SAM3S_api Peripheral Software API */
/*@{*/
/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Analog Comparator Controller */
/* ============================================================================= */
/** \addtogroup AT91SAM3S_ACC Analog Comparator Controller */
/*@{*/

